Documents/ЗакрытиеТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗакрытиеТП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗакрытиеПоСотрудникам</xr:Item>
				<xr:Item>AccumulationRegister.ПланТиражныхРабот</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТирАиП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Закрытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПланТиражныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ПланТиражныхРабот</Name>
			<Comment>Для контроля остатков работ по тиражныхм планам</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПланРаботТиражный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦенаФОТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТирАиП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТирАиП</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЗакрытиеПоСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ЗакрытиеПоСотрудникам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Подразделение - источник средств</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗакрытиеТП/Ext/ObjectModule.bsl
// проверка после проведения документов
// -закрытие актов тиражных работ 
// -закрытие тиражных проектов
Функция ОстаткиПоПлануТР( )

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗакрытиеТП.Номенклатура,
		|	ЗакрытиеТП.Цена,
		|	ЗакрытиеТП.ЦенаФОТ
		|ПОМЕСТИТЬ ВТНоменклатураЦены
		|ИЗ
		|	Документ.ЗакрытиеТП.Закрытие КАК ЗакрытиеТП
		|ГДЕ
		|	ЗакрытиеТП.Ссылка = &ЗакрытиеТиражногоПроекта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиПТР.Номенклатура,
		|	ОстаткиПТР.Цена,
		|	ОстаткиПТР.ЦенаФОТ,
		|	СУММА(ОстаткиПТР.КоличествоОстаток) КАК Остаток
		|ИЗ
		|	ВТНоменклатураЦены КАК ВТНоменклатураЦены
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПланТиражныхРабот.Остатки(, ПланРаботТиражный = &ПланРаботТиражный) КАК ОстаткиПТР
		|		ПО ВТНоменклатураЦены.Номенклатура = ОстаткиПТР.Номенклатура
		|			И ВТНоменклатураЦены.Цена = ОстаткиПТР.Цена
		|			И ВТНоменклатураЦены.ЦенаФОТ = ОстаткиПТР.ЦенаФОТ
		|ГДЕ
		|	ОстаткиПТР.КоличествоОстаток < 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиПТР.Номенклатура,
		|	ОстаткиПТР.Цена,
		|	ОстаткиПТР.ЦенаФОТ";

	Запрос.УстановитьПараметр("ЗакрытиеТиражногоПроекта", 	Ссылка);
	Запрос.УстановитьПараметр("ПланРаботТиражный", 			ПланРабот);
	//

	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;

КонецФункции


Процедура ОбработкаПроведения(Отказ, Режим)
	//
	Если НЕ РазрешеноПроводитьДокумент( Ссылка, Ссылка.ПланРабот.ЗадачаПроекта.Владелец ) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
	
	
	
	// 2014
	// новый регистр взамен ОстаткиАктов и ОстаткиЛимитаТП
	Движения.ОстаткиТирАиП.Записывать = Истина;
	Движение = Движения.ОстаткиТирАиП.Добавить();
	Движение.ВидДвижения 				= ВидДвиженияНакопления.Расход;
	Движение.Период 					= Дата;
	Движение.Источник 					= Проект;
	Движение.ПланРабот 					= ПланРабот;
	//
	Движение.Сумма 						= Закрытие.Итог("Сумма");


	// регистр ЗакрытиеПоСотрудникам 
	Движения.ЗакрытиеПоСотрудникам.Записывать = Истина;
	Для Каждого ТекСтрокаЗакрытие Из Закрытие Цикл
		Движение 				= Движения.ЗакрытиеПоСотрудникам.Добавить();
		Движение.Период 		= МесяцНачисления; // месяц начисления
		Движение.ФизическоеЛицо	= ТекСтрокаЗакрытие.ФизическоеЛицо;
		Движение.Источник 		= Проект;
		Движение.Подразделение 	= Проект.Подразделение;
		Движение.ПланРабот		= ПланРабот; // с 11,02,2013
		Движение.Сумма 			= ТекСтрокаЗакрытие.Сумма;
	КонецЦикла;

	// регистр ПланТиражныхРабот Расход
	тзЗакрытие = Закрытие.Выгрузить();
	тзЗакрытие.Свернуть("Номенклатура,Цена,ЦенаФОТ", "Количество,Скидка");
	
	Движения.ПланТиражныхРабот.Записывать = Истина;
	Для Каждого СтрТЗ Из тзЗакрытие Цикл
		Движение = Движения.ПланТиражныхРабот.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Дата;
		Движение.ПланРаботТиражный 	= ПланРабот;
		Движение.Номенклатура 		= СтрТЗ.Номенклатура;
		Движение.Цена 				= СтрТЗ.Цена;
		Движение.ЦенаФОТ 			= СтрТЗ.ЦенаФОТ;
		//
		Движение.Количество 		= СтрТЗ.Количество;
		// реквизиты
		Движение.Месяц 				= НачалоМесяца(МесяцНачисления);
		Движение.Скидка				= СтрТЗ.Скидка;
	КонецЦикла;
	// записываем проведение	
	Движения.Записать();
	
	
	//
	ОстаткиПоПлануТиражныхРабот = ОстаткиПоПлануТР();
	Для Каждого Остаток ИЗ ОстаткиПоПлануТиражныхРабот Цикл
		Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не хватает " + (-Остаток.Остаток)+ " " + Остаток.Номенклатура.ЕдиницаИзмерения + " " + Остаток.Номенклатура + ", по цене "+ Остаток.Цена + 
		" (Цена ФОТ " + Остаток.ЦенаФОТ + ")";

        Сообщение.Сообщить();
		Если НЕ УП_ПереносДанных.ПроведениеПриПереносе() Тогда
        	Отказ = Истина;      
		КонецЕсли;
		
	КонецЦикла;
	
	// здесь надо написать остатки по лимиту плана работ !!!
	
	
КонецПроцедуры
